<?php

/**
 *
 * @package phpBB Sitemaker [English]
 * @copyright (c) 2012 Daniel A. (blitze)
 * @license http://opensource.org/licenses/gpl-2.0.php GNU General Public License v2
 *
 */

/**
 * @ignore
 */
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

$lang = array_merge($lang, array(
	'ADD_BLOCK_EXPLAIN'							=> '* Σύρετε και απόθεση μπλοκ',
	'AJAX_ERROR'								=> 'Ωχ! Παρουσιάστηκε σφάλμα κατά την επεξεργασία του αιτήματός σας. Παρακαλώ δοκιμάστε ξανά.',
	'AJAX_LOADING'								=> 'Φόρτωση...',
	'AJAX_PROCESSING'							=> 'Εργάζεται...',

	'BACKGROUND'								=> 'Φόντο',
	'BLOCKS'									=> 'Μπλοκ',
	'BLOCKS_COPY_FROM'							=> 'Αντιγραφή Μπλοκ',
	'BLOCK_ACTIVE'								=> 'Ενεργό',
	'BLOCK_CHILD_ROUTES_ONLY'					=> 'Εμφάνιση μόνο σε θυγατρικές διαδρομές',
	'BLOCK_CHILD_ROUTES_HIDE'					=> 'Απόκρυψη σε θυγατρικές διαδρομές',
	'BLOCK_CLASS'								=> 'Κλάση CSS',
	'BLOCK_CLASS_EXPLAIN'						=> 'Τροποποίηση εμφάνισης μπλοκ με κλάσεις CSS',
	'BLOCK_DESIGN'								=> 'Εμφάνιση',
	'BLOCK_DISPLAY_TYPE'						=> 'Εμφάνιση',
	'BLOCK_HIDE_TITLE'							=> 'Απόκρυψη τίτλου μπλοκ?',
	'BLOCK_INACTIVE'							=> 'Ανενεργό',
	'BLOCK_MISSING_TEMPLATE'					=> 'Λείπει το απαιτούμενο πρότυπο μπλοκ. Επικοινωνήστε με τον προγραμματιστή',
	'BLOCK_NOT_FOUND'							=> 'Ωχ! Η υπηρεσία μπλοκ που ζητήθηκε δεν βρέθηκε',
	'BLOCK_NO_DATA'								=> 'Δεν υπάρχουν δεδομένα για εμφάνιση',
	'BLOCK_NO_ID'								=> 'Ωχ! Λείπει το id μπλοκ',
	'BLOCK_PERMISSION'							=> 'Άδεια',
	'BLOCK_PERMISSION_ALLOW'					=> 'Εμφάνιση σε',
	'BLOCK_PERMISSION_DENY'						=> 'Απόκρυψη από',
	'BLOCK_PERMISSION_EXPLAIN'					=> 'Χρήση CTRL + κλικ για εναλλαγή επιλογής',
	'BLOCK_SHOW_ALWAYS'							=> 'Πάντα',
	'BLOCK_STATUS'								=> 'Κατάσταση',
	'BLOCK_UPDATED'								=> 'Οι ρυθμίσεις μπλοκ ενημερώθηκαν επιτυχώς',

	'CANCEL'									=> 'Ακύρωση',
	'CHILD_ROUTE'								=> 'Παιδί',
	'CHILD_ROUTE_EXPLAIN'						=> '/viewforum.php, /dir/index.php<br />/viewtopic.php?f=2&t=1<br />/articles/my-article',
	'CLEAR'										=> 'Εκκαθάριση',
	'COPY'										=> 'Αντιγραφή',
	'COPY_BLOCKS'								=> 'Αντιγραφή Μπλοκών?',
	'COPY_BLOCKS_CONFIRM'						=> 'Είστε βέβαιοι ότι θα θέλατε να αντιγράψετε μπλοκ από μια άλλη σελίδα?<br /><br />Αυτό θα διαγράψει όλα τα υπάρχοντα μπλοκ και τις ρυθμίσεις τους για αυτή τη σελίδα και θα τα αντικαταστήσει με τα μπλοκ από την επιλεγμένη σελίδα.',

	'DEFAULT_LAYOUT_EXPLAIN'					=> 'Αν οριστεί, όλες οι σελίδες της ιστοσελίδας για τις οποίες δεν έχετε καθορίσει μπλοκ θα κληρονομήσουν τα μπλοκ από την προεπιλεγμένη διάταξη. Μπορείτε, ωστόσο, να παρακάμψετε την προεπιλεγμένη διάταξη για συγκεκριμένες σελίδες χρησιμοποιώντας τις επιλογές προς τα δεξιά.',
	'DELETE'									=> 'Διαγραφή',
	'DELETE_ALL_BLOCKS'							=> 'Διαγραφή Όλων Των Μπλοκ',
	'DELETE_ALL_BLOCKS_CONFIRM'					=> 'Είστε βέβαιοι ότι θα θέλατε να διαγράψετε όλα τα μπλοκ για αυτή τη σελίδα?',
	'DELETE_BLOCK'								=> 'Διαγραφή Μπλοκ',
	'DELETE_BLOCK_CONFIRM'						=> 'Είστε βέβαιοι ότι θέλετε να διαγράψετε αυτό το μπλοκ?<br /><br /><br /><strong>Σημείωση:</strong> Θα πρέπει να αποθηκεύσετε τις αλλαγές διάταξης για να γίνει αυτό μόνιμο.',

	'EDIT'										=> 'Επεξεργασία',
	'EDIT_BLOCK'								=> 'Επεξεργασία Μπλοκ',
	'EXIT_EDIT_MODE'							=> 'Λειτουργία Επεξεργασίας Έξοδος',

	'FEED_PROBLEMS'								=> 'Υπήρξε ένα πρόβλημα κατά την επεξεργασία της παρεχόμενης τροφοδοσίας rss/atom',
	'FEED_URL_MISSING'							=> 'Παραθέστε τουλάχιστον μία τροφοδοσία rss/atom για να ξεκινήσετε',
	'FIELD_INVALID'								=> 'Η παρεχόμενη τιμή για το πεδίο “%s” έχει μια μη έγκυρη μορφή',
	'FIELD_REQUIRED'							=> '“%s” είναι ένα απαιτούμενο πεδίο',
	'FIELD_TOO_LONG'							=> 'Η παρεχόμενη τιμή για το πεδίο “%1$s” είναι πολύ μεγάλη. Η μέγιστη αποδεκτή τιμή είναι %2$d.',
	'FIELD_TOO_SHORT'							=> 'Η παρεχόμενη τιμή για το πεδίο “%1$s” είναι πολύ μικρή. Η ελάχιστη αποδεκτή τιμή είναι %2$d.',

	'HIDE_ALL_BLOCKS'							=> 'Να μην εμφανίζονται τα μπλοκ σε αυτή τη σελίδα',
	'HIDE_BLOCK_POSITIONS'						=> 'Να μην εμφανίζονται τα μπλοκ για τις ακόλουθες θέσεις μπλοκ:',

	'IMAGES'									=> 'Εικόνες',

	'LAYOUT'									=> 'Διάταξη',
	'LAYOUT_SAVED'								=> 'Η διάταξη αποθηκεύτηκε επιτυχώς!',
	'LAYOUT_SETTINGS'							=> 'Ρυθμίσεις Διάταξης',
	'LEAVE_CONFIRM'								=> 'Έχετε κάποιες μη αποθηκευμένες αλλαγές σε αυτή τη σελίδα. Παρακαλώ αποθηκεύστε την εργασία σας πριν προχωρήσετε',
	'LISTS'										=> 'Λίστες',

	'MAKE_DEFAULT_LAYOUT'						=> 'Ορισμός Ως Προεπιλεγμένη Διάταξη',

	'OR'										=> '<strong>Ή</strong>',

	'PARENT_ROUTE'								=> 'Γονικός',
	'PARENT_ROUTE_EXPLAIN'						=> '/index.php<br />/viewforum.php?f=2<br />/articles',
	'PREDEFINED_CLASSES'						=> 'Προκαθορισμένες κλάσεις',

	'REDO'										=> 'Επανάληψη',
	'REMOVE_DEFAULT_LAYOUT'						=> 'Αφαίρεση Ως Προεπιλεγμένη Διάταξη',
	'REMOVE_STARTPAGE'							=> 'Αφαίρεση Αρχικής Σελίδας',
	'ROUTE_HIDDEN_BLOCKS'						=> 'Τα μπλοκ είναι κρυμμένα για αυτή τη σελίδα',
	'ROUTE_HIDDEN_POSITIONS'					=> 'Τα μπλοκ κρύβονται για τις ακόλουθες θέσεις',
	'ROUTE_UPDATED'								=> 'Οι ρυθμίσεις σελίδας ενημερώθηκαν επιτυχώς',

	'SAVE_CHANGES'								=> 'Αποθήκευση Αλλαγών',
	'SAVE_SETTINGS'								=> 'Αποθήκευση Ρυθμίσεων',
	'SELECT_ICON'								=> 'Επιλέξτε ένα εικονίδιο',
	'SETTINGS'									=> 'Ρυθμίσεις',
	'SETTING_TOO_BIG'							=> 'Η παρεχόμενη τιμή για τη ρύθμιση “%1$s” είναι πολύ υψηλή. Η μέγιστη αποδεκτή τιμή είναι %2$d.',
	'SETTING_TOO_LONG'							=> 'Η παρεχόμενη τιμή για τη ρύθμιση “%1$s” είναι πολύ μεγάλη. Το μέγιστο αποδεκτό μήκος είναι %2$d.',
	'SETTING_TOO_LOW'							=> 'Η παρεχόμενη τιμή για τη ρύθμιση “%1$s” είναι πολύ χαμηλή. Η ελάχιστη αποδεκτή τιμή είναι %2$d.',
	'SETTING_TOO_SHORT'							=> 'Η παρεχόμενη τιμή για τη ρύθμιση “%1$s” είναι πολύ μικρή. Το ελάχιστο αποδεκτό μήκος είναι %2$d.',
	'SET_STARTPAGE'								=> 'Ορισμός Ως Αρχική Σελίδα',

	'TITLES'									=> 'Τίτλοι',

	'UPDATE_SIMILAR'							=> 'Ενημέρωση μπλοκ με παρόμοιες ρυθμίσεις',
	'UNDO'										=> 'Αναίρεση',

	'VIEW_DEFAULT_LAYOUT'						=> 'Προβολή/Επεξεργασία Προκαθορισμένης Διάταξης',
	'VISIT_PAGE'								=> 'Επισκεφθείτε Τη Σελίδα',
));
